MikroElektronika/core_packages/PIC/XC8/def/PIC16F15325/mcu.h
extern volatile RX2DTPPSbits_t RX2DTPPSbits __at(0x1ECD);
// bitfield macros
#define _RX2DTPPS_RX2DTPPS_POSN                             0x0
#define _RX2DTPPS_RX2DTPPS_POSITION                         0x0
#define _RX2DTPPS_RX2DTPPS_SIZE                             0x6
#define _RX2DTPPS_RX2DTPPS_LENGTH                           0x6
#define _RX2DTPPS_RX2DTPPS_MASK                             0x3F
#define _RX2DTPPS_RX2DTPPS0_POSN                            0x0
#define _RX2DTPPS_RX2DTPPS0_POSITION                        0x0
#define _RX2DTPPS_RX2DTPPS0_SIZE                            0x1
#define _RX2DTPPS_RX2DTPPS0_LENGTH                          0x1
#define _RX2DTPPS_RX2DTPPS0_MASK                            0x1
#define _RX2DTPPS_RX2DTPPS1_POSN                            0x1
#define _RX2DTPPS_RX2DTPPS1_POSITION                        0x1
#define _RX2DTPPS_RX2DTPPS1_SIZE                            0x1
#define _RX2DTPPS_RX2DTPPS1_LENGTH                          0x1
#define _RX2DTPPS_RX2DTPPS1_MASK                            0x2
#define _RX2DTPPS_RX2DTPPS2_POSN                            0x2
#define _RX2DTPPS_RX2DTPPS2_POSITION                        0x2
#define _RX2DTPPS_RX2DTPPS2_SIZE                            0x1
#define _RX2DTPPS_RX2DTPPS2_LENGTH                          0x1
#define _RX2DTPPS_RX2DTPPS2_MASK                            0x4
#define _RX2DTPPS_RX2DTPPS3_POSN                            0x3
#define _RX2DTPPS_RX2DTPPS3_POSITION                        0x3
#define _RX2DTPPS_RX2DTPPS3_SIZE                            0x1
#define _RX2DTPPS_RX2DTPPS3_LENGTH                          0x1
#define _RX2DTPPS_RX2DTPPS3_MASK                            0x8
#define _RX2DTPPS_RX2DTPPS4_POSN                            0x4
#define _RX2DTPPS_RX2DTPPS4_POSITION                        0x4
#define _RX2DTPPS_RX2DTPPS4_SIZE                            0x1
#define _RX2DTPPS_RX2DTPPS4_LENGTH                          0x1
#define _RX2DTPPS_RX2DTPPS4_MASK                            0x10
#define _RX2DTPPS_RX2DTPPS5_POSN                            0x5
#define _RX2DTPPS_RX2DTPPS5_POSITION                        0x5
#define _RX2DTPPS_RX2DTPPS5_SIZE                            0x1
#define _RX2DTPPS_RX2DTPPS5_LENGTH                          0x1
#define _RX2DTPPS_RX2DTPPS5_MASK                            0x20

// Register: TX2CKPPS
#define TX2CKPPS TX2CKPPS
extern volatile unsigned char           TX2CKPPS            __at(0x1ECE);
#ifndef _LIB_BUILD
asm("TX2CKPPS equ 01ECEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TX2CKPPS               :6;
    };
    struct {
        unsigned TX2CKPPS0              :1;
        unsigned TX2CKPPS1              :1;
        unsigned TX2CKPPS2              :1;
        unsigned TX2CKPPS3              :1;
        unsigned TX2CKPPS4              :1;
        unsigned TX2CKPPS5              :1;
    };
} TX2CKPPSbits_t;
extern volatile TX2CKPPSbits_t TX2CKPPSbits __at(0x1ECE);
// bitfield macros
#define _TX2CKPPS_TX2CKPPS_POSN                             0x0
#define _TX2CKPPS_TX2CKPPS_POSITION                         0x0
#define _TX2CKPPS_TX2CKPPS_SIZE                             0x6
#define _TX2CKPPS_TX2CKPPS_LENGTH                           0x6
#define _TX2CKPPS_TX2CKPPS_MASK                             0x3F
#define _TX2CKPPS_TX2CKPPS0_POSN                            0x0
#define _TX2CKPPS_TX2CKPPS0_POSITION                        0x0
#define _TX2CKPPS_TX2CKPPS0_SIZE                            0x1
#define _TX2CKPPS_TX2CKPPS0_LENGTH                          0x1
#define _TX2CKPPS_TX2CKPPS0_MASK                            0x1
#define _TX2CKPPS_TX2CKPPS1_POSN                            0x1
#define _TX2CKPPS_TX2CKPPS1_POSITION                        0x1
#define _TX2CKPPS_TX2CKPPS1_SIZE                            0x1
#define _TX2CKPPS_TX2CKPPS1_LENGTH                          0x1
#define _TX2CKPPS_TX2CKPPS1_MASK                            0x2
#define _TX2CKPPS_TX2CKPPS2_POSN                            0x2
#define _TX2CKPPS_TX2CKPPS2_POSITION                        0x2
#define _TX2CKPPS_TX2CKPPS2_SIZE                            0x1
#define _TX2CKPPS_TX2CKPPS2_LENGTH                          0x1
#define _TX2CKPPS_TX2CKPPS2_MASK                            0x4
#define _TX2CKPPS_TX2CKPPS3_POSN                            0x3
#define _TX2CKPPS_TX2CKPPS3_POSITION                        0x3
#define _TX2CKPPS_TX2CKPPS3_SIZE                            0x1
#define _TX2CKPPS_TX2CKPPS3_LENGTH                          0x1
#define _TX2CKPPS_TX2CKPPS3_MASK                            0x8
#define _TX2CKPPS_TX2CKPPS4_POSN                            0x4
#define _TX2CKPPS_TX2CKPPS4_POSITION                        0x4
#define _TX2CKPPS_TX2CKPPS4_SIZE                            0x1
#define _TX2CKPPS_TX2CKPPS4_LENGTH                          0x1
#define _TX2CKPPS_TX2CKPPS4_MASK                            0x10
#define _TX2CKPPS_TX2CKPPS5_POSN                            0x5
#define _TX2CKPPS_TX2CKPPS5_POSITION                        0x5
#define _TX2CKPPS_TX2CKPPS5_SIZE                            0x1
#define _TX2CKPPS_TX2CKPPS5_LENGTH                          0x1
#define _TX2CKPPS_TX2CKPPS5_MASK                            0x20

// Register: RA0PPS
#define RA0PPS RA0PPS
extern volatile unsigned char           RA0PPS              __at(0x1F10);
#ifndef _LIB_BUILD
asm("RA0PPS equ 01F10h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RA0PPS0                :1;
        unsigned RA0PPS1                :1;
        unsigned RA0PPS2                :1;
        unsigned RA0PPS3                :1;
        unsigned RA0PPS4                :1;
    };
} RA0PPSbits_t;
extern volatile RA0PPSbits_t RA0PPSbits __at(0x1F10);
// bitfield macros
#define _RA0PPS_RA0PPS0_POSN                                0x0
#define _RA0PPS_RA0PPS0_POSITION                            0x0
#define _RA0PPS_RA0PPS0_SIZE                                0x1
#define _RA0PPS_RA0PPS0_LENGTH                              0x1
#define _RA0PPS_RA0PPS0_MASK                                0x1
#define _RA0PPS_RA0PPS1_POSN                                0x1
#define _RA0PPS_RA0PPS1_POSITION                            0x1
#define _RA0PPS_RA0PPS1_SIZE                                0x1
#define _RA0PPS_RA0PPS1_LENGTH                              0x1
#define _RA0PPS_RA0PPS1_MASK                                0x2
#define _RA0PPS_RA0PPS2_POSN                                0x2
#define _RA0PPS_RA0PPS2_POSITION                            0x2
#define _RA0PPS_RA0PPS2_SIZE                                0x1
#define _RA0PPS_RA0PPS2_LENGTH                              0x1
#define _RA0PPS_RA0PPS2_MASK                                0x4
#define _RA0PPS_RA0PPS3_POSN                                0x3
#define _RA0PPS_RA0PPS3_POSITION                            0x3
#define _RA0PPS_RA0PPS3_SIZE                                0x1
#define _RA0PPS_RA0PPS3_LENGTH                              0x1
#define _RA0PPS_RA0PPS3_MASK                                0x8
#define _RA0PPS_RA0PPS4_POSN                                0x4
#define _RA0PPS_RA0PPS4_POSITION                            0x4
#define _RA0PPS_RA0PPS4_SIZE                                0x1
#define _RA0PPS_RA0PPS4_LENGTH                              0x1
#define _RA0PPS_RA0PPS4_MASK                                0x10

// Register: RA1PPS
#define RA1PPS RA1PPS
extern volatile unsigned char           RA1PPS              __at(0x1F11);
#ifndef _LIB_BUILD
asm("RA1PPS equ 01F11h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RA1PPS0                :1;
        unsigned RA1PPS1                :1;
        unsigned RA1PPS2                :1;
        unsigned RA1PPS3                :1;
        unsigned RA1PPS4                :1;
    };
} RA1PPSbits_t;
extern volatile RA1PPSbits_t RA1PPSbits __at(0x1F11);
// bitfield macros
#define _RA1PPS_RA1PPS0_POSN                                0x0
#define _RA1PPS_RA1PPS0_POSITION                            0x0
#define _RA1PPS_RA1PPS0_SIZE                                0x1
#define _RA1PPS_RA1PPS0_LENGTH                              0x1
#define _RA1PPS_RA1PPS0_MASK                                0x1
#define _RA1PPS_RA1PPS1_POSN                                0x1
#define _RA1PPS_RA1PPS1_POSITION                            0x1
#define _RA1PPS_RA1PPS1_SIZE                                0x1
#define _RA1PPS_RA1PPS1_LENGTH                              0x1
#define _RA1PPS_RA1PPS1_MASK                                0x2
#define _RA1PPS_RA1PPS2_POSN                                0x2
#define _RA1PPS_RA1PPS2_POSITION                            0x2
#define _RA1PPS_RA1PPS2_SIZE                                0x1
#define _RA1PPS_RA1PPS2_LENGTH                              0x1
#define _RA1PPS_RA1PPS2_MASK                                0x4
#define _RA1PPS_RA1PPS3_POSN                                0x3
#define _RA1PPS_RA1PPS3_POSITION                            0x3
#define _RA1PPS_RA1PPS3_SIZE                                0x1
#define _RA1PPS_RA1PPS3_LENGTH                              0x1
#define _RA1PPS_RA1PPS3_MASK                                0x8
#define _RA1PPS_RA1PPS4_POSN                                0x4
#define _RA1PPS_RA1PPS4_POSITION                            0x4
#define _RA1PPS_RA1PPS4_SIZE                                0x1
#define _RA1PPS_RA1PPS4_LENGTH                              0x1
#define _RA1PPS_RA1PPS4_MASK                                0x10

// Register: RA2PPS
#define RA2PPS RA2PPS
extern volatile unsigned char           RA2PPS              __at(0x1F12);
#ifndef _LIB_BUILD
asm("RA2PPS equ 01F12h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RA2PPS0                :1;
        unsigned RA2PPS1                :1;
        unsigned RA2PPS2                :1;
        unsigned RA2PPS3                :1;
        unsigned RA2PPS4                :1;
    };
} RA2PPSbits_t;
extern volatile RA2PPSbits_t RA2PPSbits __at(0x1F12);
// bitfield macros
#define _RA2PPS_RA2PPS0_POSN                                0x0
#define _RA2PPS_RA2PPS0_POSITION                            0x0
#define _RA2PPS_RA2PPS0_SIZE                                0x1
#define _RA2PPS_RA2PPS0_LENGTH                              0x1
#define _RA2PPS_RA2PPS0_MASK                                0x1
#define _RA2PPS_RA2PPS1_POSN                                0x1
#define _RA2PPS_RA2PPS1_POSITION                            0x1
#define _RA2PPS_RA2PPS1_SIZE                                0x1
#define _RA2PPS_RA2PPS1_LENGTH                              0x1
#define _RA2PPS_RA2PPS1_MASK                                0x2
#define _RA2PPS_RA2PPS2_POSN                                0x2
#define _RA2PPS_RA2PPS2_POSITION                            0x2
#define _RA2PPS_RA2PPS2_SIZE                                0x1
#define _RA2PPS_RA2PPS2_LENGTH                              0x1
#define _RA2PPS_RA2PPS2_MASK                                0x4
#define _RA2PPS_RA2PPS3_POSN                                0x3
#define _RA2PPS_RA2PPS3_POSITION                            0x3
#define _RA2PPS_RA2PPS3_SIZE                                0x1
#define _RA2PPS_RA2PPS3_LENGTH                              0x1
#define _RA2PPS_RA2PPS3_MASK                                0x8
#define _RA2PPS_RA2PPS4_POSN                                0x4
#define _RA2PPS_RA2PPS4_POSITION                            0x4
#define _RA2PPS_RA2PPS4_SIZE                                0x1
#define _RA2PPS_RA2PPS4_LENGTH                              0x1
#define _RA2PPS_RA2PPS4_MASK                                0x10

